Repository: GuiRitter/ClothesRandomizerApp
Catalog: lib/l10n/app_*.arb
Languages: pt

# actionSettings
source: Settings
pt: Configurações

# addClothingFailedString
source: Could not add clothing item.
pt: Não foi possível adicionar a roupa.

# addClothingSuccessString
source: Clothing item added successfully
pt: Roupa adicionada com sucesso.

# addClothingTitleString
source: Add clothing item
pt: Adicionar roupa

# addLocationFailedString
source: Could not add location.
pt: Não foi possível adicionar o local.

# addLocationSuccessString
source: Location added successfully.
pt: Local adicionado com sucesso.

# addLocationTitleString
source: Add location
pt: Adicionar local

# addNameString
source: Name:
pt: Nome:

# addString
source: Add
pt: Adicionar

# addTypeFailedString
source: Could not add clothing type.
pt: Não foi possível adicionar o tipo de roupa.

# addTypeSuccessString
source: Type added successfully.
pt: Tipo de roupa adicionado com sucesso

# addTypeTitleString
source: Add type
pt: Adicionar tipo de roupa

# appName
source: Clothes Randomizer
pt: Aleatorizador de Roupas

source: 🎨 App theme
pt: 🎨 Tema do apl.

source: Cancel
pt: Cancelar

# chooseTheme
source: Choose the app''s theme:
pt: Escolha o tema do aplicativo:

# clothingTypeOrLocationNotSelected
source: Clothing type and location must be selected to get the uses.
pt: Tipo de roupa e local devem ser selecionados para pegar os usos.

# createEntity
source: Register
pt: Cadastrar

# darkTheme
source: 🌙 Dark
pt: 🌙 Escuro

# deleteClothingString
source: Remove this clothing item:
pt: Remover esta roupa:

# deleteLocationString
source: Remove this location:
pt: Remover este local:

# deleteTypeString
source: Remove this clothing type:
pt: Remover este tipo de roupa:

# deleteEntity
source: {entity, select, local{Remove this location: } piece_of_clothing_type{Remove this clothing type: } piece_of_clothing{Remove this clothing item: } other{{entity}}}
pt: {entity, select, local{Remover este local: } piece_of_clothing_type{Remover este tipo de roupa: } piece_of_clothing{Remover esta roupa: } other{{entity}}}

# deleteEntityDependency
source: {entity, select, local{ Clothes have been used in this location. The records of their uses will also be removed.} piece_of_clothing_type{ The clothing items of this type will be removed too, as well as the records of their uses.} piece_of_clothing{ The use history will be removed too.} other{{entity}}}
pt: {entity, select, local{ Roupas foram usadas neste local. O registro de seus usos também serão removidos.} piece_of_clothing_type{ As roupas deste tipo serão removidas também, assim como os registros de seus usos.} piece_of_clothing{ O histórico de uso será removido também.} other{{entity}}}

# entitiesName
source: {entity, select, local{Locations} piece_of_clothing_type{Clothing types} piece_of_clothing{Clothing items} other{{entity}}}
pt: {entity, select, local{Locais} piece_of_clothing_type{Tipos de roupa} piece_of_clothing{Roupas} other{{entity}}}

# entityHeader
source: {entity, select, local__name{Name} piece_of_clothing_type__name{Name} piece_of_clothing__piece_of_clothing_type{Clothing type} piece_of_clothing__name{Name} other{{entity}}}
pt: {entity, select, local__name{Nome} piece_of_clothing_type__name{Nome} piece_of_clothing__type__display{Tipo de roupa} piece_of_clothing__name{Nome} other{{entity}}}

# entityName
source: {entity, select, local{Location} piece_of_clothing_type{Clothing type} piece_of_clothing{Clothing item} other{{entity}}}
pt: {entity, select, local{Local} piece_of_clothing_type{Tipo de roupa} piece_of_clothing{Roupa} other{{entity}}}

source: Invalid password.
pt: Senha inválida.

source: Invalid user ID.
pt: ID de usuário inválida.

source: Keep
pt: Manter

# lastUse
source: Last used: {lastDateTime}
pt: Último uso: {lastDateTime}

# lightTheme
source: ☀ Light
pt: ☀ Claro

source: Loading
pt: Carregando

# mainClothingString
source: Manage clothing items
pt: Gerenciar roupas

# mainLocationString
source: Manage locations
pt: Gerenciar locais

# mainTypeString
source: Manage clothing types
pt: Gerenciar tipos de roupas

# menuAddItem
source: Add use
pt: Adicionar uso

# menuIgnoreItem
source: Ignore
pt: Ignorar

# menuRegardItem
source: Regard
pt: Considerar

# menuRemoveItem
source: Remove use
pt: Remover uso

source: Password
pt: Senha

# randomizeButtonString
source: Randomize
pt: Aleatorizar

# reload
source: 🔄 Reload data
pt: 🔄 Recarregar dados

source: Remove
pt: Remover

# selectLocationString
source: Select a location:
pt: Selecione um local:

# selectTitleClothingString
source: Clothing items
pt: Roupas

# selectTitleLocationString
source: Locations
pt: Locais

# selectTitleTypeString
source: Clothing types
pt: Tipos de roupas

# selectTypeString
source: Select a clothing type:
pt: Selecione um tipo de roupa:

source: Sign in
pt: Autenticar

source: ⛔ Sign out
pt: ⛔ Sair

# systemTheme
source: ⚙ System
pt: ⚙ Sistema

# testDarkTheme
source: 🤡 🌙 Test
pt: 🤡 🌙 Teste

# testLightTheme
source: 🤡 ☀ Test
pt: 🤡 ☀ Teste

# title
source: Clothes Randomizer
pt: Aleatorizador de Roupas

# useAddString
source: Add use to this clothing item:
pt: Adicionar uso para esta roupa:

# useRemoveString
source: Remove use from this clothing item:
pt: Remover uso desta roupa:

source: User ID
pt: ID do usuário

# usesPlural
source: {count, plural, =0{0 uses.} =1{1 use.} other{{count} uses.}}
pt: {count, plural, =0{0 usos.} =1{1 uso.} other{{count} usos.}}

# usesString
source: Uses:
pt: Usos:
